.scratch/script.yml
# Thank you for trying serverless-artillery!
# This default script is intended to get you started quickly.
# There is a lot more that Artillery can do.
# You can find great documentation of the possibilities at:
# https://artillery.io/docs/
mode: acc
sampling:
  size: 1
  errorBudget: 1
  warningThreshold: 1

config:
  target: 'https://postman-echo.com/headers'
  phases:
    - duration: 5
      arrivalRate: 10
    - duration: 5
      arrivalRate: 5
  defaults:
    headers:
      my-sample-header: "my-sample-header-value"

scenarios:
  - flow:
    - get:
        url: "/"
    - get:
        url: "/"
        match:
          - json: "$.headers.my-sample-header"
            value: "my-sample-header-valueXX"
          - json: "$.headers.host"
            value: "postman-echo.com"
  - flow:
    - get:
        url: "/"
    - get:
        url: "/"
        match:
          - json: "$.headers.my-sample-header"
            value: "my-sample-header-value"
          - json: "$.headers.host"
            value: "postman-echo.com"
  - flow:
    - get:
        url: "/"
    - get:
        url: "/"
        match:
          - json: "$.headers.my-sample-header"
            value: "my-sample-header-value"
          - json: "$.headers.host"
            value: "postman-echo.com"
  - flow:
    - get:
        url: "/"
    - get:
        url: "/"
        match:
          - json: "$.headers.my-sample-header"
            value: "my-sample-header-value"
          - json: "$.headers.host"
            value: "postman-echo.com"
  - flow:
    - get:
        url: "/"
    - get:
        url: "/"
        match:
          - json: "$.headers.my-sample-header"
            value: "my-sample-header-value"
          - json: "$.headers.host"
            value: "postman-echo.com"